In [4]:
import pandas as pd

In [5]:
df=pd.read_csv(r"Desktop/ML/hiring.csv")
df

     exp  test_score  inter  salary
0    NaN         6.0      7   10000
1    NaN         7.0      6   15000
2   four        10.0      9   45000
3    two         8.0      7   40000
4    one         NaN      6   35000
5  seven         5.0      7   30000
6  eight         7.0      3   25000

In [7]:
import math

med=math.floor(df.test_score.median())
df.test_score=df.test_score.fillna(med)
df

     exp  test_score  inter  salary
0    NaN         6.0      7   10000
1    NaN         7.0      6   15000
2   four        10.0      9   45000
3    two         8.0      7   40000
4    one         7.0      6   35000
5  seven         5.0      7   30000
6  eight         7.0      3   25000

In [8]:
df.exp=df.exp.fillna("zero")
from word2number import w2n
df.exp=df.exp.apply(w2n.word_to_num)
df

   exp  test_score  inter  salary
0    0         6.0      7   10000
1    0         7.0      6   15000
2    4        10.0      9   45000
3    2         8.0      7   40000
4    1         7.0      6   35000
5    7         5.0      7   30000
6    8         7.0      3   25000

In [9]:
from sklearn import linear_model
reg=linear_model.LinearRegression()
reg.fit(df[["exp","test_score","inter"]],df.salary)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [10]:
reg.predict([[5,3,7]])

array([14955.44325671])

In [11]:
reg.intercept_

-24822.37582382255

In [12]:
reg.coef_

array([1862.34126346, 4458.23621604, 2441.6291593 ])

# y=m1*x1+m2*x2+m3*x3+b

In [13]:
1862.34126346*5+4458.23621604*3+2441.6291593*7+(-24822.37582382255)

14955.44325669745